

//Задание 1
// System.Console.Write("Введите трёхзначное число -> ");
// int threeDigitNumber = Convert.ToInt32(Console.ReadLine());
// string stringNumber = Convert.ToString(threeDigitNumber);
// System.Console.WriteLine($"Вторая цифра трёхначного числа ->"+stringNumber[1]);

//Задание 2
 
// System.Console.Write("Введите  число -> ");
// int anyNumber = Convert.ToInt32(Console.ReadLine());
// string anyNumberOne = Convert.ToString(anyNumber);
// if(anyNumberOne.Length > 2)
// {
//     System.Console.WriteLine($"Третье число ->"+anyNumberOne[2]);
// }
// else
// {
//     System.Console.WriteLine($"Третье число отсутствует");
// }


// //Задание 3

// System.Console.Write("Введите число недели -> ");
// int dayNumber = Convert.ToInt32(Console.ReadLine());
// void CheckingTheDayOfTheWeek(int dayNumber)
// {
//     if(dayNumber == 6 || dayNumber == 7)
//     {
//     System.Console.WriteLine($"Это выходной день");
//     }
//     else if (dayNumber < 1 || dayNumber > 7)
//     {
//     System.Console.WriteLine($"Это не день недели");
//     }
//     else
//     System.Console.WriteLine($"Это будничный день");
// }
// CheckingTheDayOfTheWeek(dayNumber);


